Revit 2027 API
BuiltInFailures.GeneralFailures.CannotSetParameter Property
 Cant set parameter
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotSetParameter { get; }
Public Shared ReadOnly Property CannotSetParameter As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotSetParameter {
	FailureDefinitionId^ get ();
}
static member CannotSetParameter : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GeneralFailures Class
Autodesk.Revit.DB Namespace